Repository: sslavik/acdat
Catalog: TMXParser/en-es.tmx
Source language: en
Languages: es

source: Support for this functions are not enabled by default.
es: minimo tamaño de memoria compartida, por lo general 1 byte

source: the ability to manage tens and even hundreds of thousands of users.
es: In numerous productive BS2000 installations, SESAM / SQL-Server has proven...

source: The BS2000 PLAM library must be set ACCESS=READ,SHARE=YES because it must be readable by the apache server 's user id.
es: Now there is a PHP3 SESAM interface available which allows database operations via PHP-scripts.

source: Name of SESAM application configuration file.
es: Configuration notes:

source: Name of SESAM message catalog file.
es: Tabla 1.

source: Because the SQL command quoting for single quotes uses duplicated single quotes (as opposed to a single quote preceded by a backslash, used in some other databases), it is advisable to set the PHP configuration directives php3_magic_quotes_gpc and php3_magic_quotes_sybase to On for all PHP scripts using the SESAM interface.
es: Runtime considerations:

source: Restrict access to php scripts which must administer the database by using password control and / or SSL security.
es: Migration from other SQL databases:

source: Instead of int( 4) (intended use: integers up to '9999'), SESAM requires simply int Instead of int(4) (intended use: integers up to '9999'), SESAM requires simply int for an implied size of 31 bits.
es: Instead of int( 4) (intended use: integers up to '9999'), SESAM requires simply int for an implied size of 31 bits.

source: When specifying RESTRICT, an error is returned if there are dependent objects (e.g., VIEWs), while with CASCADE, dependent objects will be deleted along with the specified table.
es: Notes on the use of various SQL types:

source: This enables you to build more customized applications and increase the appeal of your web site.
es: El apoyo que PHP proporciona para las sesiones consiste en una forma de conservar ciertos datos a lo largo de los subsiguientes accesos, lo cual le permite construir aplicaciones más personalizadas e incrementar el atractivo de su sitio web.

source: A visitor accessing your web site is assigned an unique id, the so-called session id.
es: Si ya está familiarizado con el tratamiento de sesiones de PHPLIB, notará que algunos conceptos son similares al soporte de las sesiones de PHP.

source: The session support allows you to register arbitrary numbers of variables to be preserved across requests.
es: A cada visitante que accede a su web se le asigna un identificador único, llamado "session id" (identificador de sesión).

source: All registered variables are serialized after the request finishes.
es: Éste se almacena en una cookie por parte del usuario o se propaga en la URL.

source: On subsequent accesses, these are not defined by the session module unless the user defines them later.
es: El soporte de las sesiones le permite registrar un número arbitrario de variables que se conservarán en las siguientes peticiones.

source: This holds true regardless of if a session has been started using the session_start() function.
es: Cuando un visitante acceda a su web, PHP comprobará automáticamente (si session.auto_start está puesto a 1) o cuando usted lo especifique (de forma explícita mendiante session_start() o implícita a través de session_register()) si se le ha enviado un "session id "específico con su petición, en cuyo caso se recrean las variables que se habían guardado anteriormente.

source: Session fixation
es: Todas las variables registradas son almacenadas tras finalizar la petición.

source: The session module cannot guarantee that the information you store in a session is only viewed by the user who created the session.
es: Las variables que están indefinidas se marcan como no definidas.

source: Assess the importance of the data carried by your sessions and deploy addditional protections - - this usually comes at a price, reduced convenience for the user.
es: En los subsiguientes accesos, no estarán definidas por el módulo de sesiones a menos que el usuario las defina más tarde.

source: In that case, cookies must be enabled unconditionally on the user side, or sessions will not work.
es: Las opciones de configuración track_vars y register_globals influyen notablemente en la forma en que las variables de la sesión se almacenan y restauran.

source: There are several ways to leak an existing session id to third parties.
es: Nota:

source: A leaked session id enables the third party to access all resources which are associated with a specific id.
es: A partir de PHP 4.0.3, track_vars siempre está activado.

source: First, URLs carrying session ids.
es: Nota:

source: If you link to an external site, the URL including the session id might be stored in the external site 's referrer logs.
es: A partir de PHP 4.1.0, $_SESSION está disponible como variable global, al igual que $_POST, $_GET, $_REQUEST y demás.

source: Second, a more active attacker might listen to your network traffic.
es: Al contrario que $HTTP_SESSION_VARS, $_SESSION siempre es global.

source: If it is not encrypted, session ids will flow in plain text over the network.
es: Por tanto, no se debe usar global para $_SESSION.

source: Optionally you can use shared memory allocation (mm), developed by Ralf S.
es: Las variables restauradas de la sesión sólo estarán disponibles en el vector $HTTP_SESSION_VARS.

source: Engelschall, for session storage.
es: Ejemplo 1.

source: This option is not available for Windows platforms.
es: Registrar una variable con track_vars activado

source: It might be more appropiate to use a shared memory based filesystem (such as tmpfs on Solaris / Linux, or / dev / md on BSD) to store sessions in files, because they are properly locked.
es: ?php session_start(); if (isset($HTTP_SESSION_VARS['count'])) {$HTTP_SESSION_VARS['count']++;} else {$HTTP_SESSION_VARS['count'] = 0;}?

source: If you would not like to build your PHP with session support, you should specify the --disable-session option to configure.
es: Se recomienda usar $_SESSION (o $HTTP_SESSION_VARS con PHP 4.0.6 o inferior) por seguridad y para hacer el código más legible.

source: Session configuration options
es: Ejemplo 2.

source: session.gc_probability
es: Registrar una variable con $_SESSION.

source: session.serialize_handler
es: ?php session_start(); / / Use $HTTP_SESSION_VARS con PHP 4.0.6 o inferior if (!isset($_SESSION['count'])) {$_SESSION['count'] = 0;} else {$_SESSION['count']++;}?

source: session.use_only_cookies
es: Ejemplo 3.

source: "a=href,area=href,frame=src,input=src,form=fakeentry"
es: Borrar una variable con $_SESSION.

source: The session management system supports a number of configuration options which you can place in your php.ini file.
es: ?php session_start(); / / Use $HTTP_SESSION_VARS con PHP 4.0.6 o inferior unset($_SESSION['count']);?

source: session.save_handler defines the name of the handler which is used for storing and retrieving data associated with a session.
es: Si register_globals está activado, todas las variables globales pueden ser registradas como variables de la sesión, y las variables de la sesión serán restauradas a sus correspondientes variables globales.

source: If you choose the default files handler, this is the path where the files are created.
es: Como PHP debe saber qué variables globles están registradas como variables de la sesión, los usuarios deben registrar las variables con la función session_register(), mientras que con $HTTP_SESSION_VARS / $_SESSION no es necesario usar session_register().

source: Defaults to / tmp.
es: Atención

source: See also session_save_path().
es: Si está usando $HTTP_SESSION_VARS / $_SESSION y desactiva register_globals, no use session_register(), session_is_registered() ni session_unregister().

source: If you leave this set to a world-readable directory, such as / tmp (the default), other users on the server may be able to hijack sessions by getting the list of files in that directory.
es: Si activa register_globals, session_unregister() debería ser usado a partir de que las variables de la sesión sean registradas como variables globales cuando los datos de la sesión se guardan.

source: Windows users have to change this variable in order to use PHP 's session functions.
es: Se recomienda desactivar register_globals por motivos de seguridad y rendimiendo.

source: Make sure to specify a valid path, e.g.: c: / temp.
es: Ejemplo 4.

source: It should only contain alphanumeric characters.
es: Registrar una variable con register_globals activado

source: Defaults to 0 (disabled).
es: Si track_vars y register_globals están activados, las variables globales y las entradas de $HTTP_SESSION_VARS / $_SESSION harán referencia al mismo valor para variables ya registradas.

source: Currently, a PHP internal format (name php) and WDDX is supported (name wddx).
es: Si el usuario utiliza session_register() para registrar una variable, el vector $HTTP_SESSION_VARS / $_SESSION no contendrá esa variable hasta que se cargue de los datos de la sesión. (p.ej. hasta la próxima petición).

source: WDDX is only available, if PHP is compiled with WDDX support.
es: Hay dos formas de propagar un "session id":

source: Defaults to 1.
es: El módulo de sesiones admite ambas formas.

source: If you are using the default file-based session handler, your filesystem must keep track of access times (atime).
es: El segundo método incrusta el "session id" directamente en las URLs.

source: Windows FAT does not so you will have to come up with another way to handle garbage collecting your session if you are stuck with a FAT filesystem or any other fs where atime tracking is not available.
es: PHP es capaz de hacerlo de forma transparente al usuario cuando se compila con --enable-trans-sid.

source: If the Referer was sent by the client and the substring was not found, the embedded session id will be marked as invalid.
es: Si activa esta opción, las URIs relativas serán modificadas de forma que contengan el session id automáticamente.

source: session.entropy_file gives a path to an external resource (file) which will be used as an additional entropy source in the session id creation process.
es: Alternativamente, puede usar la constante SID que está definida, si el cliente no envía la cookie adecuada.

source: session.entropy_length specifies the number of bytes which will be read from the file specified above.
es: El SID puede tener la forma de nombre_de_sesion=session_id o ser una cadena vacía.

source: session.use_cookies session.use_cookies specifies whether the module will use cookies to store the session id on the client side.
es: El ejemplo siguiente demuestra cómo registrar una variable, y cómo colocar correctamente un enlace a otra página usando la constante SID.

source: Defaults to 1 (enabled).
es: Ejemplo 5.

source: session.use_only_cookies specifies whether the module will only use cookies to store the session id on the client side.
es: Contar el número de impresiones de un usuario

source: This setting was added in PHP 4.3.0.
es: Hola, visitante.

source: The value 0 means "until the browser is closed." Defaults to 0 .See also session_get_cookie_params() and session_set_cookie_params().
es: Has visto esta p aacute; gina ?php echo $count;? veces. ?php # el ?php echo SID? (Se puede usar ?=SID? si short tag est aacute; activado) # es necesario para conservar el session id # en caso de que el usuario haya desactivado las cookies?

source: Defaults to / .See also session_get_cookie_params() and session_set_cookie_params().
es: Para continuar, haga click A HREF=" nextpage.php? ?php echo SID? "aqu iacute; / A.

source: session.cookie_domain specifies the domain to set in session_cookie.
es: El ?=SID? no es necesario si se ha usado --enable-trans-sid al compilar PHP.

source: Default is none at all.
es: Nota:

source: session.cookie_secure specifies whether cookies should only be sent over secure connections.
es: Se asume que las URLs no relativas apuntan a sitios web externos, y por tanto no se añade el SID, ya que pasar el SID a un servidor diferente podría ocasionar un agujero de seguridad.

source: session.cache_limiter specifies cache control method to use for session pages (none / nocache / private / private_no_expire / public).
es: Para implementar el almacenamiento en bases de datos o en otro tipo de almacenamiento, necesitará usar session_set_save_handler( )() para crear una colección de funciones de almacenamiento a nivel de usuario.

source: session.cache_expire specifies time-to-live for cached session pages in minutes, this has no effect for nocache limiter.
es: El sistema de control de sesiones soporta varias opciones de configuración que puede colocar en su archivo php.ini.

source: Defaults to 180.
es: Les daremos un pequeño repaso.

source: session.use_trans_sid whether transparent sid support is enabled or not.
es: session.save_handler session.save_handler define el nombre del controlador que se usa para almacenar y recuperar los datos asociados a la sesión.

source: From PHP 4.2.0, trans-sid feature is always compiled.
es: session.save_path session.save_path define el argumento que se pasa al controlador de almacenamiento.

source: URL based session management has additional security risks compared to cookie based session management.
es: Si elige el controlador de archivos por defecto, esta es la ruta donde los archivos se crean.

source: url_rewriter.tags url_rewriter.tags specifies which html tags are rewritten to include session id if transparent sid support is enabled.
es: Por defecto es / tmp.

source: The track_vars and register_globals configuration settings influence how the session variables get stored and restored.
es: Si la profundidad de la ruta de session.save_path es mayor que 2, no se llevará a cabo la recolección de basura.

source: As of PHP 4.0.3, track_vars is always turned on.
es: Aviso

source: Unlike $HTTP_SESSION_VARS, $_SESSION is always global.
es: Sólo debería contener caracteres alfanuméricos.

source: Therefore, you do not need to use the global keyword for $_SESSION.
es: Por defecto vale PHPSESSID.

source: You can substitute $HTTP_SESSION_VARS for $_SESSION, if you prefer the former.
es: session.auto_start session.auto_start especifica si el módulo de las sesión inicia una sesión automáticamente al comenzar la petición.

source: Also note that you must start your session using session_start() before use of $_SESSION becomes available.
es: Por defecto está 0 (desactivado).

source: For more details see the section on variables in this manual.
es: session.cookie_lifetime session.cookie_lifetime especifica la duración de la cookie en segundos que se manda al navegador.

source: The restored session variables will only be available in the array $_SESSION.
es: El valor 0 significa "hasta que se cierra el navegador", y es el que se encuentra por defecto.

source: With $_SESSION, there is no need to use the session_register(), session_unregister(), session_is_registered() functions.
es: session.serialize_handler define el nombre del controlador que se utiliza para guardar y restaurar los datos.

source: ?php session_start(); / / Use $HTTP_SESSION_VARS with PHP 4.0.6 or less if (!isset($_SESSION['count'])) {$_SESSION['count'] = 0;} else {$_SESSION['count']++;}?
es: WDDX sólo está disponible si PHP está compilado con Soporte para WDDX.

source: ?php session_start(); / / Use $HTTP_SESSION_VARS with PHP 4.0.6 or less unset($_SESSION['count']);?
es: session.gc_probability session.gc_probability especifica la probabilidad de que se inicie la rutina gc (garbage collection - recoleción de basura) en cada petición en porcentaje.

source: ?php session_start(); / / With PHP 4.3 and later, you can also simply use the prior example. session_unregister('count');?
es: session.gc_maxlifetime especifica el número de segundos tras los cuales los datos se considerarán como 'basura' y serán eliminados.

source: Upon a restart of a session, these variables will be restored to corresponding global variables.
es: session.referer_check session.referer_check contiene la subcadena que usted quiera que se compruebe en cada "HTTP Referer" (N.T.:

source: You can avoid this by simply setting entries in $_SESSION.
es: Página desde donde proviene el enlace a la página actual).

source: If you are using $_SESSION and disable register_globals, do not use session_register(), session_is_registered() and session_unregister(), if your scripts shall work in PHP 4.2 and earlier.
es: Si el "Referer" fue enviado por el cliente y la subcadena no se ha encontrado, el session id incrustado será marcado como inválido.

source: You can use these functions in 4.3 and later.
es: Por defecto es una cadena vacía.

source: Disabling register_globals is recommended for both security and performance reasons.
es: session.entropy_file session.entropy_file indica la ruta a un recurso externo (un archivo) que se usará como fuente adicional de entropía en el proceso de creación de session id 's.

source: Registering a variable with register_globals enabled
es: Por ejemplo / dev / random o / dev / urandom, que están disponibles en muchos sistemas Unix.

source: If register_globals is enabled, then the global variables and the $_SESSION entries will automatically reference the same values which were registered in the prior session instance.
es: session.entropy_length session.entropy_length especifica el número de bytes que serán leidos del archivo indicado más arriba.

source: There is a defect in PHP 4.2.3 and earlier.
es: Por defecto es 0 (desactivado).

source: I.e. a modification to the newly registered global variable will not be reflected by the $_SESSION entry.
es: session.use_cookies session.use_cookies indica si el módulo puede usar cookies para guardar el session id en el lado del cliente.

source: This has been corrected in PHP 4.3.
es: Por defecto está a 1 (activado).

source: Cookies
es: session.cookie_path session.cookie_path especifica la ruta a colocar en session_cookie.

source: The session module supports both methods.
es: Por defecto es /.

source: The second method embeds the session id directly into URLs.
es: session.cookie_domain especifica el dominio a establecer en session_cookie.

source: Unless you are using PHP 4.2 or later, you need to enable it manually when building PHP.
es: Por defecto no se especifica ninguno en ningún caso.

source: If this build option and the run-time option session.use_trans_sid are enabled, relative URIs will be changed to contain the session id automatically.
es: session.cache_limiter session.cache_limiter especifica el método de control del caché a usar en las páginas de la sesión (none / nocache / private / private_no_expire / public).

source: The arg_separator.output php.ini directive allows to customize the argument seperator.
es: Por defecto es nocache (no guardar las páginas en el caché).

source: Alternatively, you can use the constant SID which is always defined.
es: session.cache_expire session.cache_expire especifica el tiempo-de-vida de las páginas de la sesión que se encuentran en el caché en minutos.

source: If the client did not send an appropriate session cookie, it has the form session_name=session_id.
es: No tiene efecto para el limitador nocache.

source: Otherwise, it expands to an empty string.
es: Por defecto vale 180.

source: The following example demonstrates how to register a variable, and how to link correctly to another page using SID.
es: session.use_trans_sid indica si la inclusión del sid transparente está activada o no, si fue activada compilando con --enable-trans-sid.

source: Counting the number of hits of a single user
es: Por defecto está a 1 (activado).

source: Hello visitor, you have seen this page ?php echo $count;? times. p To continue, A HREF="nextpage.php? ?php echo SID? "click here / A
es: url_rewriter.tags url_rewriter.tags especifica qué etiquetas html serán reescritas para incluir el session id si la inclusión del sid transparente está activada.

source: The ?=SID? is not necessary, if --enable-trans-sid was used to compile PHP.
es: Las etiquetas por defecto son a=href,area=href,frame=src,input=src,form=fakeentry

source: Non-relative URLs are assumed to point to external sites and hence don 't append the SID, as it would be a security risk to leak the SID to a different server.
es: Nota:

source: To implement database storage, or any other storage method, you will need to use session_set_save_handler() to create a set of user-level storage functions.
es: El manejo de sesiones fue añadido en PHP 4.0.

source: These functions will not typically work on Windows, as it does not support shared memory.
es: Shmop is an easy to use set of functions that allows php to read, write, create and delete UNIX shared memory segments.

source: As of Windows 2000 though, enabling the php_shmop.dll in your php.ini will enable this functionality though.
es: The functions will not work on windows, as it does not support shared memory.

source: In PHP 4.0.3, these functions were prefixed by shm rather than shmop.
es: To use shmop you will need to compile php with the --enable-shmop parameter in your configure line.

source: In order to use the SNMP functions on Unix you need to install the UCD SNMP package.
es: Para usar las funciones SNMP en Unix necesita instalar el paquete UCD SNMP.

source: On Windows these functions are only available on NT and not on Win95 / 98.
es: En Windows estas funciones están solamente disponibles en NT y no en Win95 / 98.

source: Important:
es: Importante:

source: After configuring UCD SNMP, edit config.h and search for NO_ZEROLENGTH_COMMUNITY.
es: Para usar el paquete UCD SNMP, necesita definir NO_ZEROLENGTH_COMMUNITY a 1 antes de compilarlo.

source: It should look like this afterwards:
es: Despues de configurar UCD SNMP, edite config.h y busque NO_ZEROLENGTH_COMMUNITY.

source: #define NO_ZEROLENGTH_COMMUNITY 1
es: Descomente la línea #define.

source: If you see strange segmentation faults in combination with SNMP commands, you did not follow the above instructions.
es: Debería de verse como sigue:

source: This directory should be moved to DRIVE:\usr\mibs, where DRIVE must be replaced with the driveletter where PHP is installed on, e.g.: c:\usr\mibs.
es: Si ve faltas de segmentación desconocidas en combinación con los comandos SNMP, no siga las siguientes instrucciones.

source: For a more generic client-side socket interface, see fsockopen() and pfsockopen().
es: Aviso

source: When using these functions, it is important to remember that while many of them have identical names to their C counterparts, they often have different declarations.
es: Este módulo es EXPERIMENTAL.

source: Those unfamiliar with socket programming can find a lot of useful material in the appropriate Unix man pages, and there is a great deal of tutorial information on socket programming in C on the web, much of which can be applied, with slight modifications, to socket programming in PHP.
es: Esto significa que el comportamineto de estas funciones, nombre de funciones y en definitiva TODO lo documentado aqui, puede cambiar en una futura version de PHP SIN AVISO.

source: The socket extension was written to provide a useable interface to the powerful BSD sockets.
es: That said, those unfamiliar with socket programming can still find a lot of useful material in the appropriate Unix man pages, and there is a great deal of tutorial information on socket programming in C on the web, much of which can be applied, with slight modifications, to socket programming in PHP.

source: Care has been taken that the functions work equally well on Win32 and Unix implementations.
es: Ejemplo 1.

source: See their description for more information.
es: Change the address and port variables to suit your setup and execute.
